// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9

Console.Clear();

int Akkerman(int m, int n)
{
    if (m == 0) return n + 1;
    else if (m > 0 && n == 0) return Akkerman(m - 1, 1);
    else if (m > 0 && n > 0) return Akkerman(m - 1, Akkerman(m, n - 1));
    else return 0;
}

Console.Write("Input number 1: ");
int M = int.Parse(Console.ReadLine()!);

Console.Write("Input number 2: ");
int N = int.Parse(Console.ReadLine()!);

Console.WriteLine(Akkerman(M, N));